outputs/openfoam_backup/0009/constant/polyMesh/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 -15 0)
    (500 -15 0)
    (712.4 -4.38 0)
    (750 -2.5 0)
    (950 -2.5 0)
    (966 -0.9 0)
    (975 0 0)
    (1006 3.1 0)
    (1111 13.6 0)
    (1200 22.5 0)
    (0 -4.38 0)
    (500 -4.38 0)
    (712.4 -4.235 0)
    (750 -2.355 0)
    (950 -2.355 0)
    (966 -0.755 0)
    (975 0.145 0)
    (1006 3.245 0)
    (1111 13.745 0)
    (1200 22.645 0)
    (0 -2.5 0)
    (500 -2.5 0)
    (712.4 -2.5 0)
    (750 -2.21 0)
    (950 -2.21 0)
    (966 -0.61 0)
    (975 0.29 0)
    (1006 3.39 0)
    (1111 13.89 0)
    (1200 22.79 0)
    (0 13.6 0)
    (500 13.6 0)
    (712.4 13.6 0)
    (750 13.6 0)
    (950 13.6 0)
    (966 13.6 0)
    (975 13.6 0)
    (1006 13.6 0)
    (1111 14.035 0)
    (1200 22.935 0)
    (0 27.5 0)
    (500 27.5 0)
    (712.4 27.5 0)
    (750 27.5 0)
    (950 27.5 0)
    (966 27.5 0)
    (975 27.5 0)
    (1006 27.5 0)
    (1111 27.5 0)
    (1200 27.5 0)
    (0 -15 0.1)
    (500 -15 0.1)
    (712.4 -4.38 0.1)
    (750 -2.5 0.1)
    (950 -2.5 0.1)
    (966 -0.9 0.1)
    (975 0 0.1)
    (1006 3.1 0.1)
    (1111 13.6 0.1)
    (1200 22.5 0.1)
    (0 -4.38 0.1)
    (500 -4.38 0.1)
    (712.4 -4.235 0.1)
    (750 -2.355 0.1)
    (950 -2.355 0.1)
    (966 -0.755 0.1)
    (975 0.145 0.1)
    (1006 3.245 0.1)
    (1111 13.745 0.1)
    (1200 22.645 0.1)
    (0 -2.5 0.1)
    (500 -2.5 0.1)
    (712.4 -2.5 0.1)
    (750 -2.21 0.1)
    (950 -2.21 0.1)
    (966 -0.61 0.1)
    (975 0.29 0.1)
    (1006 3.39 0.1)
    (1111 13.89 0.1)
    (1200 22.79 0.1)
    (0 13.6 0.1)
    (500 13.6 0.1)
    (712.4 13.6 0.1)
    (750 13.6 0.1)
    (950 13.6 0.1)
    (966 13.6 0.1)
    (975 13.6 0.1)
    (1006 13.6 0.1)
    (1111 14.035 0.1)
    (1200 22.935 0.1)
    (0 27.5 0.1)
    (500 27.5 0.1)
    (712.4 27.5 0.1)
    (750 27.5 0.1)
    (950 27.5 0.1)
    (966 27.5 0.1)
    (975 27.5 0.1)
    (1006 27.5 0.1)
    (1111 27.5 0.1)
    (1200 27.5 0.1)
);

blocks
(
    hex (0 1 11 10 50 51 61 60) (250 14 1) simpleGrading (1 1 1)
    hex (10 11 21 20 60 61 71 70) (250 7 1) simpleGrading (1 1 1)
    hex (20 21 31 30 70 71 81 80) (250 56 1) simpleGrading (1 1 1)
    hex (30 31 41 40 80 81 91 90) (250 10 1) simpleGrading (1 1 1)
    hex (1 2 12 11 51 52 62 61) (212 14 1) simpleGrading (1 1 1)
    hex (11 12 22 21 61 62 72 71) (212 7 1) simpleGrading (1 1 1)
    hex (21 22 32 31 71 72 82 81) (212 56 1) simpleGrading (1 1 1)
    hex (31 32 42 41 81 82 92 91) (212 10 1) simpleGrading (1 1 1)
    hex (2 3 13 12 52 53 63 62) (38 14 1) simpleGrading (1 1 1)
    hex (12 13 23 22 62 63 73 72) (38 7 1) simpleGrading (1 1 1)
    hex (22 23 33 32 72 73 83 82) (38 56 1) simpleGrading (1 1 1)
    hex (32 33 43 42 82 83 93 92) (38 10 1) simpleGrading (1 1 1)
    hex (3 4 14 13 53 54 64 63) (200 14 1) simpleGrading (1 1 1)
    hex (13 14 24 23 63 64 74 73) (200 7 1) simpleGrading (1 1 1)
    hex (23 24 34 33 73 74 84 83) (200 56 1) simpleGrading (1 1 1)
    hex (33 34 44 43 83 84 94 93) (200 10 1) simpleGrading (1 1 1)
    hex (4 5 15 14 54 55 65 64) (64 14 1) simpleGrading (1 1 1)
    hex (14 15 25 24 64 65 75 74) (64 7 1) simpleGrading (1 1 1)
    hex (24 25 35 34 74 75 85 84) (64 56 1) simpleGrading (1 1 1)
    hex (34 35 45 44 84 85 95 94) (64 10 1) simpleGrading (1 1 1)
    hex (5 6 16 15 55 56 66 65) (36 14 1) simpleGrading (1 1 1)
    hex (15 16 26 25 65 66 76 75) (36 7 1) simpleGrading (1 1 1)
    hex (25 26 36 35 75 76 86 85) (36 56 1) simpleGrading (1 1 1)
    hex (35 36 46 45 85 86 96 95) (36 10 1) simpleGrading (1 1 1)
    hex (6 7 17 16 56 57 67 66) (124 14 1) simpleGrading (1 1 1)
    hex (16 17 27 26 66 67 77 76) (124 7 1) simpleGrading (1 1 1)
    hex (26 27 37 36 76 77 87 86) (124 56 1) simpleGrading (1 1 1)
    hex (36 37 47 46 86 87 97 96) (124 10 1) simpleGrading (1 1 1)
    hex (7 8 18 17 57 58 68 67) (210 14 1) simpleGrading (1 1 1)
    hex (17 18 28 27 67 68 78 77) (210 7 1) simpleGrading (1 1 1)
    hex (27 28 38 37 77 78 88 87) (210 56 1) simpleGrading (1 1 1)
    hex (37 38 48 47 87 88 98 97) (210 10 1) simpleGrading (1 1 1)
    hex (8 9 19 18 58 59 69 68) (178 14 1) simpleGrading (1 1 1)
    hex (18 19 29 28 68 69 79 78) (178 7 1) simpleGrading (1 1 1)
    hex (28 29 39 38 78 79 89 88) (178 56 1) simpleGrading (1 1 1)
    hex (38 39 49 48 88 89 99 98) (178 10 1) simpleGrading (1 1 1)
);

patches
(
    patch atmosphere
    (
        (40 90 91 41)
        (41 91 92 42)
        (42 92 93 43)
        (43 93 94 44)
        (44 94 95 45)
        (45 95 96 46)
        (46 96 97 47)
        (47 97 98 48)
        (48 98 99 49)
    )
    patch inlet
    (
        (0 50 60 10)
        (10 60 70 20)
        (20 70 80 30)
        (30 80 90 40)
    )
    patch outlet
    (
        (9 19 69 59)
        (19 29 79 69)
        (29 39 89 79)
        (39 49 99 89)
    )
    wall bottom
    (
        (0 1 51 50)
        (1 2 52 51)
        (2 3 53 52)
        (3 4 54 53)
        (4 5 55 54)
        (5 6 56 55)
        (6 7 57 56)
        (7 8 58 57)
        (8 9 59 58)
    )
    empty frontBack
    (
        (0 10 11 1)
        (50 51 61 60)
        (10 20 21 11)
        (60 61 71 70)
        (20 30 31 21)
        (70 71 81 80)
        (30 40 41 31)
        (80 81 91 90)
        (1 11 12 2)
        (51 52 62 61)
        (11 21 22 12)
        (61 62 72 71)
        (21 31 32 22)
        (71 72 82 81)
        (31 41 42 32)
        (81 82 92 91)
        (2 12 13 3)
        (52 53 63 62)
        (12 22 23 13)
        (62 63 73 72)
        (22 32 33 23)
        (72 73 83 82)
        (32 42 43 33)
        (82 83 93 92)
        (3 13 14 4)
        (53 54 64 63)
        (13 23 24 14)
        (63 64 74 73)
        (23 33 34 24)
        (73 74 84 83)
        (33 43 44 34)
        (83 84 94 93)
        (4 14 15 5)
        (54 55 65 64)
        (14 24 25 15)
        (64 65 75 74)
        (24 34 35 25)
        (74 75 85 84)
        (34 44 45 35)
        (84 85 95 94)
        (5 15 16 6)
        (55 56 66 65)
        (15 25 26 16)
        (65 66 76 75)
        (25 35 36 26)
        (75 76 86 85)
        (35 45 46 36)
        (85 86 96 95)
        (6 16 17 7)
        (56 57 67 66)
        (16 26 27 17)
        (66 67 77 76)
        (26 36 37 27)
        (76 77 87 86)
        (36 46 47 37)
        (86 87 97 96)
        (7 17 18 8)
        (57 58 68 67)
        (17 27 28 18)
        (67 68 78 77)
        (27 37 38 28)
        (77 78 88 87)
        (37 47 48 38)
        (87 88 98 97)
        (8 18 19 9)
        (58 59 69 68)
        (18 28 29 19)
        (68 69 79 78)
        (28 38 39 29)
        (78 79 89 88)
        (38 48 49 39)
        (88 89 99 98)
    )
);

mergePatchPairs
(
);