outputs/openfoam_backup/0009/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.48726e-07;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1.48726e-07;
        value           uniform 1.48726e-07;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1.48726e-07;
        value           uniform 1.48726e-07;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.48726e-07;
        value           uniform 1.48726e-07;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 1.48726e-07;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //